<a href="https://colab.research.google.com/github/tlysenko/CreditScoring/blob/master/Copy_of_First_step.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

  #                                Знакомство с Pandas

In [ ]:
import pandas as pd

In [ ]:
frame = pd.DataFrame({"numbers": range(10), "chars": ["a"]*10})

In [ ]:
frame

   numbers chars
0        0     a
1        1     a
2        2     a
3        3     a
4        4     a
5        5     a
6        6     a
7        7     a
8        8     a
9        9     a

In [ ]:
frame = pd.read_csv("dataset.tsv", header=0, sep="\t")

In [ ]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [ ]:
frame.columns

Index(['Name', 'Birth', 'City', 'Position'], dtype='object')

In [ ]:
frame.shape

(6, 4)

In [ ]:
new_line = {"Name": "Perov", "Birth": "22.03.1990", "City": "Penza"}

In [ ]:
frame.append(new_line, ignore_index=True)

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6            Perov  22.03.1990      Penza       NaN

In [ ]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер

In [ ]:
frame = frame.append(new_line, ignore_index=True)

In [ ]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер
5     Костров С.О.  31.05.1985     Москва    стажер
6            Perov  22.03.1990      Penza       NaN

In [ ]:
frame["IsStudent"] = False*5 + True*2

In [ ]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN          2
1     Сорокин И.В.  07.08.1965  Волгоград   инженер          2
2       Белов М.М.  13.02.1980     Ростов  менеджер          2
3  Мельникова Д.С.  15.04.1985     Ростов       NaN          2
4      Рыбина Е.П.  19.11.1985     Москва   инженер          2
5     Костров С.О.  31.05.1985     Москва    стажер          2
6            Perov  22.03.1990      Penza       NaN          2

In [ ]:
frame.drop([5,6], axis=0)

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN          2
1     Сорокин И.В.  07.08.1965  Волгоград   инженер          2
2       Белов М.М.  13.02.1980     Ростов  менеджер          2
3  Мельникова Д.С.  15.04.1985     Ростов       NaN          2
4      Рыбина Е.П.  19.11.1985     Москва   инженер          2

In [ ]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN          2
1     Сорокин И.В.  07.08.1965  Волгоград   инженер          2
2       Белов М.М.  13.02.1980     Ростов  менеджер          2
3  Мельникова Д.С.  15.04.1985     Ростов       NaN          2
4      Рыбина Е.П.  19.11.1985     Москва   инженер          2
5     Костров С.О.  31.05.1985     Москва    стажер          2
6            Perov  22.03.1990      Penza       NaN          2

In [ ]:
frame.drop([5,6], axis=0, inplace=True)

In [ ]:
frame

              Name       Birth       City  Position  IsStudent
0      Иванов А.А.  22.03.1980     Москва       NaN          2
1     Сорокин И.В.  07.08.1965  Волгоград   инженер          2
2       Белов М.М.  13.02.1980     Ростов  менеджер          2
3  Мельникова Д.С.  15.04.1985     Ростов       NaN          2
4      Рыбина Е.П.  19.11.1985     Москва   инженер          2

In [ ]:
frame.drop("IsStudent", axis=1, inplace=True)

In [ ]:
frame

              Name       Birth       City  Position
0      Иванов А.А.  22.03.1980     Москва       NaN
1     Сорокин И.В.  07.08.1965  Волгоград   инженер
2       Белов М.М.  13.02.1980     Ростов  менеджер
3  Мельникова Д.С.  15.04.1985     Ростов       NaN
4      Рыбина Е.П.  19.11.1985     Москва   инженер

In [ ]:
frame.to_csv("updated_dataset.csv", sep=",", header=True, index=None)

In [ ]:
!cat updated_dataset.csv

Name,Birth,City,Position
Иванов А.А.,22.03.1980,Москва,
Сорокин И.В.,07.08.1965,Волгоград,инженер
Белов М.М.,13.02.1980,Ростов,менеджер
Мельникова Д.С.,15.04.1985,Ростов,
Рыбина Е.П.,19.11.1985,Москва,инженер